Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In order to enable the Monitoring for user-defined projects, we need to follow the instructions https://docs.openshift.com/container-platform/4.7/monitoring/enabling-monitoring-for-user-defined-projects.html[from OpenShift documentation].
ja_jp: ユーザー定義のプロジェクトのモニタリングを有効にするためには、 link:https://docs.openshift.com/container-platform/4.7/monitoring/enabling-monitoring-for-user-defined-projects.html[OpenShiftのドキュメント]の指示に従う必要があります。

source: In order to execute some custom action when the HTTP server is started you'll need to declare an _asynchronous_ CDI observer method. Quarkus _asynchronously_ fires CDI events of types `io.quarkus.vertx.http.HttpServerStart`, `io.quarkus.vertx.http.HttpsServerStart` and `io.quarkus.vertx.http.DomainSocketServerStart` when the corresponding HTTP server starts listening on the configured host and port.
ja_jp: HTTP サーバーの起動時にカスタムアクションを実行するには、_非同期_ の CDI オブザーバーメソッドを宣言する必要があります。 Quarkus は、対応する HTTP サーバーが設定されたホストとポートでリッスンを開始すると、`io.quarkus.vertx.http.HttpServerStart`、`io.quarkus.vertx.http.HttpsServerStart`、および `io.quarkus.vertx.http.DomainSocketServerStart` タイプの CDI イベントを _非同期的_ に起動します。

source: In order to first generate or update existing snapshots files on your local filesystem, you need to add `-Dsnap` when running the tests locally while developing the codestart. They need to be added as part of the commit, else the tests will not pass on the CI.
ja_jp: ローカルファイルシステム上の既存のスナップショットファイルを最初に生成または更新するためには、Codestartの開発中にローカルでテストを実行する際に、 `-Dsnap` を追加する必要があります。これらはコミットの一部として追加する必要があり、そうしないとCI上でテストが通過しません。

source: In order to fulfill our goal of being a more inclusive and fostering a more collaborative environment, we have moved to the Commonhaus Foundation. This is a step to further solidify our commitment to open-source development and enterprise adoption, addressing the perception that it was overly dependent on a single vendor (Red Hat). This move aims to provide a neutral ground where other organizations and contributors can feel equally valued and involved, ensuring Quarkus continues to thrive, supported by a broad base of contributors from multiple organizations.
ja_jp: より包括的で協調的な環境を育むという目標を達成するため、私たちはCommonhaus Foundationへ移行しました。これは、オープンソース開発とエンタープライズでの採用へのコミットメントをさらに強固にするためのステップであり、特定のベンダー (Red Hat) に過度に依存しているという認識に対処するものです。この移行は、他の組織や貢献者が等しく評価され、関与できる中立的な場を提供し、複数の組織からの幅広い貢献者に支えられながらQuarkusが繁栄し続けることを目指しています。

source: In order to get rid of these limitations, you can link:{hibernate-search-doc-prefix}#architecture-examples-outbox-polling-elasticsearch[use the `outbox-polling` coordination strategy]. This strategy creates an outbox table in the database to push entity change events to, and relies on a background processor to consume these events and perform automatic indexing.
ja_jp: このような制限をなくすために、 link:{hibernate-search-doc-prefix}#architecture-examples-outbox-polling-elasticsearch[`outbox-polling`] 調整ストラテジーを使用することができます。このストラテジーではデータベースに outbox テーブルを作成してエンティティ変更イベントをプッシュし、バックグラウンドでイベントを処理し、自動インデックス作成を行います。

source: In order to get rid of these limitations, you can link:{hibernate-search-docs-url}#architecture-examples-outbox-polling-elasticsearch[use the `outbox-polling` coordination strategy]. This strategy creates an outbox table in the database to push entity change events to, and relies on a background processor to consume these events and perform indexing.
ja_jp: このような制限をなくすために、link:{hibernate-search-docs-url}#architecture-examples-outbox-polling-elasticsearch[`outbox-polling` 調整ストラテジーを使用] できます。このストラテジーは、データベースに outbox テーブルを作成してエンティティ変更イベントをプッシュし、バックグラウンドでイベントを処理し、自動インデックスを作成します。

source: In order to get this information, beginning in Quarkus 3.2, when you run Quarkus the first time in dev mode (`quarkus dev`, `mvn quarkus:dev`, etc.) you get asked if you agree to contribute anonymous build data to the Quarkus community.
ja_jp: この情報を取得するために、Quarkus 3.2以降では、Quarkusを初めてdevモード（`quarkus dev`、 `mvn quarkus:dev`など）で実行したときに、匿名のビルドデータをQuarkusコミュニティに提供することに同意するかどうかを尋ねられます。

source: In order to have Quarkus support secure connections, you must either provide a certificate and associated key file, or supply a keystore.
ja_jp: Quarkus でセキュアな接続をサポートするには、証明書と関連するキーファイルを提供するか、キーストアを提供する必要があります。

source: In order to leverage OpenShift S2I to build the container image on the cluster and use the resulting container image for the Knative application, we need to set a couple of configuration properties:
ja_jp: OpenShift S2I を利用してクラスタ上にコンテナイメージを構築し、その結果のコンテナイメージをKnativeアプリケーションで使用するためには、いくつかの設定プロパティを設定する必要があります。

source: In order to leverage the lightweight nature of virtual threads, the default maximum concurrency for methods annotated with `@RunOnVirtualThread` is 1024. As opposed to platform threads, virtual threads are not pooled and created per message. Therefore the maximum concurrency applies separately to all `@RunOnVirtualThread` methods.
ja_jp: 仮想スレッドの軽量な性質を活用するために、 `@RunOnVirtualThread` アノテーションが付けられたメソッドのデフォルトの最大同時実行数は 1024 です。 プラットフォームスレッドとは異なり、仮想スレッドはプールされず、メッセージごとに作成されます。したがって、最大同時実行数はすべての `@RunOnVirtualThread` メソッドに個別に適用されます。

source: In order to make it easy for extension authors to test their extensions daily against the latest snapshot of Quarkus, Quarkus has introduced the notion of Ecosystem CI. The Ecosystem CI link:https://github.com/quarkusio/quarkus-ecosystem-ci/blob/main/README.adoc[README] has all the details on how to set up a GitHub Actions job to take advantage of this capability, while this link:https://www.youtube.com/watch?v=VpbRA1n0hHQ[video] provides an overview of what the process looks like.
ja_jp: エクステンションの作者が、Quarkusの最新のスナップショットに対して自分のエクステンションを毎日簡単にテストできるようにするために、QuarkusはEcosystem CIという概念を導入しました。Ecosystem CIの link:https://github.com/quarkusio/quarkus-ecosystem-ci/blob/main/README.adoc[README]には、この機能を利用するためにGitHub Actionsジョブをセットアップする方法の詳細が記載されており、この link:https://www.youtube.com/watch?v=VpbRA1n0hHQ[ビデオ]ではそのプロセスの概要を説明しています。

source: In order to make sure the right dependency versions are being used by Gradle, the BOM is declared as an `enforcedPlatform` in your build file. By default, the `maven-publish` plugin will prevent you from publishing your application due to this `enforcedPlatform`. This validation can be skipped by adding the following configuration in your build file:
ja_jp: Gradle で正しい依存関係のバージョンが使用されていることを担保するために、BOM はビルドファイル内で `enforcedPlatform` として宣言されています。デフォルトでは、 `maven-publish` プラグインは、この `enforcedPlatform` を理由にアプリケーションの公開を阻止します。 `build.gradle` ファイルに以下の設定を追加することで、この検証をスキップすることができます。

source: In order to make your extension listed in the Dev UI you don't need to do anything!
ja_jp: エクステンションをDev UIに表示させるためには、何もする必要はありません!

source: In order to map a Java class to a Database table, just:
ja_jp: Java クラスをデータベーステーブルにマッピングするには、次の手順を実行します。

source: In order to measure memory correctly **DO NOT use docker stat or anything derived from it** (e.g. ctop). This approach only measures a subset of the in-use resident pages, while the Linux Kernel, cgroups and cloud orchestration providers will utilize the full resident set in their accounting (determining whether a process is over the limits and should be killed).
ja_jp: メモリを正しく測定するためには、 **docker statやそれに由来するもの（ctopなど）を使用しないでください** 。この方法では、使用中のレジデントページのサブセットしか測定できません。一方、Linuxカーネル、cgroups、およびクラウドオーケストレーションプロバイダは、アカウンティング（プロセスが制限を超えているかどうか、強制終了すべきかどうかの判断）に完全なレジデントセットを利用します。

source: In order to not incur the performance overhead of running with NVM enabled, we measure the total RSS of an JVM application using tools specific to each platform.
ja_jp: NVMを有効にして実行する際のパフォーマンスオーバーヘッドを発生させないために、各プラットフォームに特化したツールを使用して、JVMアプリケーションの総RSSを測定します。

source: In order to provide a health check, you should do the following:
ja_jp: ヘルスチェックを行うためには、以下のようにしましょう。

source: In order to provide a transparent and comprehensive performance picture, Quarkus rebuilt its benchmark. Learn more in "Quarkus has great performance – and we have new evidence" by Holly Cummins. Read "How Project Leyden brought a new perspective" by Guillaume Smet to see how Project Leyden gave us a new perspective on how we think about startup performance in Quarkus. Check out Juarez Junior's post "Unleash the Power of AI Agents with Java: Building Intelligent Applications with Quarkus, LangChain4j, and Oracle AI Database" to learn how to build a Quarkus-based AI support agent that handles customer support for Oracle database error codes. See how executable architecture tests with Taikai replace diagrams, reviews, and tribal knowledge in modern Java systems in "Your Java Architecture Is Lying to You: Enforcing Real Boundaries with Quarkus" by Markus Eisele. Nowadays, Java enterprise applications often default to Angular, React, or Vue for the frontend. But for this kind of applications, the most natural UI framework already exists in the Java ecosystem: Jakarta Faces. Learn more in "Rethinking Java Web UIs with Jakarta Faces and Quarkus" by Nicolas Duminil. See how Markus Eisele built a streaming ingestion pipeline with SSE, batching, and PostgreSQL to track Java-related conversations in "Listening to the Fediverse with Java: A Real-Time Quarkus Experiment". Read "DPoP: What It Is, How It Works, and Why Bearer Tokens Aren’t Enough" by Hüseyin Akdoğan to learn what DPoP (Demonstration of Proof-of-Possession) is, what problem it solves, and walk through a working implementation with Keycloak and Quarkus.
ja_jp: 透明で包括的なパフォーマンス像を提供するため、Quarkusはそのベンチマークを再構築しました。Holly Cumminsによる「Quarkus has great performance – and we have new evidence」で詳細をご覧ください。Guillaume Smetによる「How Project Leyden brought a new perspective」を読んで、Project LeydenがQuarkusにおける起動パフォーマンスについて考える新しい視点をどのように与えたかをご覧ください。Juarez Juniorの投稿「Unleash the Power of AI Agents with Java: Building Intelligent Applications with Quarkus, LangChain4j, and Oracle AI Database」をチェックして、Oracleデータベースのエラーコードに関する顧客サポートを処理するQuarkusベースのAIサポートエージェントを構築する方法を学びましょう。Markus Eiseleによる「Your Java Architecture Is Lying to You: Enforcing Real Boundaries with Quarkus」で、Taikaiを使った実行可能なアーキテクチャテストが、最新のJavaシステムでどのように図、レビュー、部族の知識に取って代わるかをご覧ください。今日、Javaエンタープライズアプリケーションは、フロントエンドにAngular、React、またはVueをデフォルトとすることがよくあります。しかし、この種のアプリケーションには、最も自然なUIフレームワークがJavaエコシステムに既に存在します。それはJakarta Facesです。Nicolas Duminilによる「Rethinking Java Web UIs with Jakarta Faces and Quarkus」で詳細をご覧ください。Markus EiseleがSSE、バッチ処理、PostgreSQLを使ってJava関連の会話を追跡するためのストリーミング取り込みパイプラインをどのように構築したか、「Listening to the Fediverse with Java: A Real-Time Quarkus Experiment」でご覧ください。Hüseyin Akdoğanによる「DPoP: What It Is, How It Works, and Why Bearer Tokens Aren’t Enough」を読んで、DPoP（Demonstration of Proof-of-Possession）とは何か、それが解決する問題、そしてKeycloakとQuarkusを使った動作する実装を見ていきましょう。

source: In order to re-augment your Quarkus application with different build time properties, start the application with the desired configuration plus the `quarkus.launch.rebuild` system property set to `true`.
ja_jp: 異なるビルド時のプロパティでQuarkusアプリケーションを再オーグメンテーションするには、目的の設定に加えて、 `quarkus.launch.rebuild` システムプロパティを `true` に設定してアプリケーションを起動します。

source: In order to reindex an entity type, it needs to be <<loading,configured for loading from an external source>>.
ja_jp: エンティティータイプのインデックスを再作成するには、 <<loading,configured for loading from an external source>> である必要があります。

source: In order to resolve the tenant from incoming requests and map it to a specific `quarkus-oidc` tenant configuration in application.properties, you need to create an implementation for the `io.quarkus.oidc.TenantConfigResolver` interface which can be used to resolve the tenant configurations dynamically:
ja_jp: 受信リクエストからテナントを解決し、application.propertiesで特定の `quarkus-oidc` テナント設定にマッピングするためには、テナント設定を動的に解決するために使用できる `io.quarkus.oidc.TenantConfigResolver` インターフェイスの実装を作成する必要があります：

source: In order to resolve the tenant from incoming requests and map it to a specific `quarkus-oidc` tenant configuration in application.properties, you need to create an implementation for the `io.quarkus.oidc.TenantResolver` interface.
ja_jp: 受信リクエストからテナントを解決し、それを application.properties の特定の `quarkus-oidc` テナント設定にマップするには、 `io.quarkus.oidc.TenantResolver` インターフェイスの実装を作成する必要があります。

source: In order to resolve the tenant from incoming requests and map it to a specific database, you must create an implementation of the `io.quarkus.mongodb.panache.common.MongoDatabaseResolver` interface.
ja_jp: 受信リクエストからテナントを解決し、特定のデータベースにマップするには、 `io.quarkus.mongodb.panache.common.MongoDatabaseResolver` インターフェイスの実装を作成する必要があります。

source: In order to resolve the tenant from incoming requests and map it to a specific tenant configuration, you need to create an implementation for the `io.quarkus.hibernate.orm.runtime.tenant.TenantResolver` interface.
ja_jp: 受信したリクエストからテナントを解決し、特定のテナント構成にマッピングするためには、 `io.quarkus.hibernate.orm.runtime.tenant.TenantResolver` インターフェースの実装を作成する必要があります。

source: In order to restrict access to the `hello` method to users with certain roles, the `@Secured` annotation will be utilized. The updated controller will be:
ja_jp: `hello` メソッドへのアクセスを特定のロールを持つユーザーに制限するために、 `@Secured` アノテーションが使用されます。更新されたコントローラーは次のようになります。

source: In order to return an HTTP response, simply return the resource you want from your method. The method return type and its optional content type will be used to decide how to serialise it to the HTTP response (see <<negotiation>> for more advanced information).
ja_jp: HTTP レスポンスを返すには、単にメソッドから必要なリソースを返します。メソッドの戻り値の型とオプションのコンテントタイプをもとに、HTTP レスポンスへのシリアライズ方法を決定します (より詳細な情報については <<negotiation>> を参照ください)。

source: In order to return an HTTP response, simply return the resource you want from your method. The method return type and its optional content type will be used to decide how to serialise it to the HTTP response (see the <<negotiation>> section for more advanced information).
ja_jp: HTTP レスポンスを返すには、単にメソッドから必要なリソースを返します。メソッドの戻り値の型とオプションのコンテントタイプをもとに、HTTP レスポンスへのシリアライズ方法を決定します (より詳細な情報については <<negotiation>> を参照ください)。

source: In order to return an HTTP response, simply return the resource you want from your method. The method return type and its optional content type will be used to decide how to serialise it to the HTTP response (see the xref:negotiation[Negotiation] section for more advanced information).
ja_jp: HTTP レスポンスを返すには、メソッドから必要なリソースを返すだけです。メソッドの戻り値の型と、オプションのコンテントタイプを使用して、HTTPレスポンスへのシリアライズ方法を決定します（より高度な情報については、 xref:negotiation[ネゴシエーション] のセクションを参照してください）。

source: In order to run tasks on virtual threads Quarkus manages an internal `ThreadPerTaskExecutor`. In rare instances where you'd need to access this executor directly you can inject it using the `@VirtualThreads` CDI qualifier:
ja_jp: 仮想スレッド上でタスクを実行するために、Quarkus は内部 `ThreadPerTaskExecutor` を管理します。 まれにこのエクゼキューターに直接アクセスする必要がある場合は、 `@VirtualThreads` CDI 修飾子を使用して注入できます。

source: In order to run the augmentation steps you need the deployment JARs of the used Quarkus extensions. These JARs are only present in the `mutable-jar` distribution. This means that you need to build your application with `quarkus.package.jar.type=mutable-jar`. The `mutable-jar` distribution is the same as the `fast-jar` distribution, except for the additional folder `quarkus-app/lib/deployment` which contains the deployment JARs and their dependencies (and some class-loader configuration).
ja_jp: オーグメンテーションステップを実行するためには、使用される Quarkus エクステンションのデプロイメント JAR が必要です。 これらのJARは、 `mutable-jar` のディストリビューションにのみ含まれています。つまり、 `quarkus.package.jar.type=mutable-jar` でアプリケーションを構築する必要があります。 `mutable-jar` ディストリビューションは、 `fast-jar` ディストリビューションと同じですが、追加のフォルダー `quarkus-app/lib/deployment` には、 デプロイメント JAR とその依存関係 (および一部のクラスローダ設定) が含まれています。

source: In order to run the augmentation steps you need the deployment JARs of the used Quarkus extensions. These JARs are only present in the `mutable-jar` distribution. This means that you need to build your application with `quarkus.package.type=mutable-jar`. The `mutable-jar` distribution is the same as the `fast-jar` distribution, except for the additional folder `quarkus-app/lib/deployment` which contains the deployment JARs and their dependencies (and some class-loader configuration).
ja_jp: オーグメンテーションステップを実行するためには、使用されるQuarkusエクステンションのデプロイメントJARが必要です。これらのJARは、 `mutable-jar` のディストリビューションにのみ含まれています。つまり、 `quarkus.package.type=mutable-jar` でアプリケーションを構築する必要があります。 `mutable-jar` ディストリビューションは、 `fast-jar` ディストリビューションと同じですが、追加のフォルダ `quarkus-app/lib/deployment` には、デプロイメントJARとその依存関係（およびクラスローダの設定）が含まれています。

source: In order to run the integration tests as a jar with the JaCoCo agent, add the following to your `pom.xml`.
ja_jp: Jacocoエージェントで結合テストをjarとして実行するには、 `pom.xml` に以下を追加します。

source: In order to run the integration tests as a jar with the Jacoco agent, add the following to your `pom.xml`.
ja_jp: 結合テストをjarとしてJacocoエージェントと共に実行するためには、 `pom.xml` に以下を追加します。

source: In order to send Kev/Value pairs to Pulsar, you can configure the Pulsar producer Schema with a https://javadoc.io/doc/org.apache.pulsar/pulsar-client-api/latest/org/apache/pulsar/common/schema/KeyValue.html[KeyValue] schema.
ja_jp: キー/値のペアを Pulsar に送信するには、Pulsar プロデューサースキーマを https://javadoc.io/doc/org.apache.pulsar/pulsar-client-api/latest/org/apache/pulsar/common/schema/KeyValue.html[KeyValue] スキーマを使用して設定できます。

source: In order to set up OIDC for Apple you need to create a developer account, and sign up for the 99$/year program, but you cannot test your application on `localhost` like most other OIDC providers: you will need to run it over HTTPS and make it publicly accessible, so for development purposes you may want to use a service such as https://ngrok.com.
ja_jp: Apple 用の OIDC を設定するには、開発者アカウントを作成し、$99/年のプログラムにサインアップする必要がありますが、 他のほとんどの OIDC プロバイダーのように `localhost` でアプリケーションをテストできません。 HTTPS で実行して公開する必要があるため、開発目的では https://ngrok.com などのサービスを使用することをお勧めします。

source: In order to set up OIDC for Apple you need to create a developer account, and sign up for the 99€/year program, but you cannot test your application on `localhost` like most other OIDC providers: you will need to run it over `https` and make it publicly accessible, so for development purposes you may want to use a service such as https://ngrok.com.
ja_jp: Apple 用の OIDC を設定するには、開発者アカウントを作成し、99 ユーロ/年のプログラムにサインアップする必要がありますが、他のほとんどの OIDC プロバイダーのように `localhost` でアプリケーションをテストすることはできません。 `https` で実行して公開する必要があるため、開発目的では https://ngrok.com などのサービスを使用することをお勧めします。

source: In order to set up OIDC for Facebook start by https://developers.facebook.com/apps/create/[Creating an application], select `None` as an app type, and press `Next`:
ja_jp: Facebook 用の OIDC を設定するには、 https://developers.facebook.com/apps/create/[Creating an application] から開始し、アプリのタイプとして `None` を選択して `Next` を押します。

source: In order to set up OIDC for Facebook start by https://developers.facebook.com/apps/create/[Creating an application], select `Other` as an app type, and click `Next`.
ja_jp: Facebook 用の OIDC を設定するには、 https://developers.facebook.com/apps/create/[Creating an application] から開始し、アプリのタイプとして `Other` を選択して `Next` をクリックします。

source: In order to set up OIDC for GitHub you need to create a new OAuth application in your https://github.com/settings/applications/new[GitHub developer settings]:
ja_jp: GitHub の OIDC を設定するには、 https://github.com/settings/applications/new[GitHub developer settings] で新しい OAuth アプリケーションを作成する必要があります。

source: In order to set up OIDC for Google you need to create a new project in your https://console.cloud.google.com/projectcreate[Google Cloud Platform console]:
ja_jp: OIDC for Google を設定するには、 https://console.cloud.google.com/projectcreate[Google Cloud Platform console] で新しいプロジェクトを作成する必要があります。

source: In order to set up OIDC for Microsoft you need to go to your https://portal.azure.com[Microsoft Azure Portal], and search for `Azure Active Directory`, then click on it:
ja_jp: Microsoft 用の OIDC をセットアップするには、 https://portal.azure.com[Microsoft Azure Portal] にアクセスし、 `Azure Active Directory` を検索してクリックする必要があります。

source: In order to set up OIDC for Microsoft you need to go to your https://portal.azure.com[Microsoft Azure Portal], and search for `Microsoft Entra ID` formerly known as `Azure Active Directory` , then click on it:
ja_jp: Microsoft の OIDC を設定するには、 https://portal.azure.com[Microsoft Azure ポータル] にアクセスする必要があります。 `Microsoft Entra ID` (旧称 `Azure Active Directory`) を検索し、クリックします。

source: In order to set up OIDC for Twitter start by https://developer.twitter.com/en/portal/projects/new[Creating a project], enter a project name, and press `Next`:
ja_jp: Twitter 用の OIDC を設定するには、 https://developer.twitter.com/en/portal/projects/new[Creating a project] で開始し、プロジェクト名を入力して、 `Next` を押します。

source: In order to set up OIDC for X, start by https://developer.twitter.com/en/portal/projects/new[Creating a project], enter a project name, and press `Next`:
ja_jp: X 用の OIDC を設定するには、 https://developer.twitter.com/en/portal/projects/new[Creating a project] で開始し、プロジェクト名を入力して、 `Next` を押します。

source: In order to set up the Service Binding, you need first to connect OpenShift managed services to your cluster. For an OpenShift cluster you can follow the instructions from link:https://github.com/redhat-developer/app-services-guides/tree/main/docs/registry/service-binding-registry#connecting-a-kafka-and-service-registry-instance-to-your-openshift-cluster[Connecting a Kafka and Service Registry instance to your OpenShift cluster].
ja_jp: Service Binding をセットアップするには、最初に OpenShift マネージドサービスをクラスターに接続する必要があります。OpenShift クラスターの場合は、link:https://github.com/redhat-developer/app-services-guides/tree/main/docs/registry/service-binding-registry#connecting-a-kafka-and-service-registry-instance-to-your-openshift-cluster[Connecting a Kafka and Service Registry instance to your OpenShift cluster] の指示に従います。

source: In order to set up the `tenant-a` configuration to use Google OpenID Provider, you need to create a project as described https://developers.google.com/identity/protocols/OpenIDConnect[here].
ja_jp: Google OpenID プロバイダーを使用するように `tenant-a` を設定するには、 https://developers.google.com/identity/protocols/OpenIDConnect[こちら] の説明どおりにプロジェクトを作成する必要があります。

source: In order to set-up the `tenant-a` configuration to use Google OpenID Provider, you need to create a project as described https://developers.google.com/identity/protocols/OpenIDConnect[here].
ja_jp: Google OpenID プロバイダーを使用するように `tenant-a` を設定するには、 https://developers.google.com/identity/protocols/OpenIDConnect[こちら] の説明どおりにプロジェクトを作成する必要があります。

source: In order to show a more practical example of Kotlin usage we will add a simple link:https://kotlinlang.org/docs/reference/data-classes.html[data class] called `Greeting.kt` like so:
ja_jp: Kotlin のより実用的な使用例を示すために、 `Greeting.kt` というシンプルな link:https://kotlinlang.org/docs/reference/data-classes.html[データクラス] を追加してみましょう。

source: In order to show a more practical example of Kotlin usage we will add a simple link:https://kotlinlang.org/docs/reference/data-classes.html[data class] called `Greeting` like so:
ja_jp: Kotlin のより実用的な使用例を示すために、 `Greeting` というシンプルな link:https://kotlinlang.org/docs/reference/data-classes.html[データクラス] を追加してみましょう:

source: In order to successfully run the produced jar, you need to have the entire contents of the `quarkus-app` directory. If any of the files are missing, the application will not start or might not function correctly.
ja_jp: 生成された jar を正常に実行するためには、 `quarkus-app` ディレクトリのすべての内容が必要です。いずれかのファイルが欠落していると、アプリケーションが起動しなかったり、正しく機能しない可能性があります。
